RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV10Z7/include/MKV10Z7_extension.h
/*
 * Constants & macros for individual SIM_SOPT2 bitfields
 */

/*!
 * @name Register SIM_SOPT2, field CLKOUTSEL[7:5] (RW)
 *
 * Selects the clock to output on the CLKOUT pin.
 *
 * Values:
 * - 0b000 - Reserved
 * - 0b001 - Reserved
 * - 0b010 - Bus clock
 * - 0b011 - LPO clock (1 kHz)
 * - 0b100 - MCGIRCLK
 * - 0b101 - Reserved
 * - 0b110 - OSCERCLK
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_CLKOUTSEL field. */
#define SIM_RD_SOPT2_CLKOUTSEL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_CLKOUTSEL_MASK) >> SIM_SOPT2_CLKOUTSEL_SHIFT)
#define SIM_BRD_SOPT2_CLKOUTSEL(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_CLKOUTSEL_SHIFT, SIM_SOPT2_CLKOUTSEL_WIDTH))

/*! @brief Set the CLKOUTSEL field to a new value. */
#define SIM_WR_SOPT2_CLKOUTSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_CLKOUTSEL_MASK, SIM_SOPT2_CLKOUTSEL(value)))
#define SIM_BWR_SOPT2_CLKOUTSEL(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_CLKOUTSEL_SHIFT), SIM_SOPT2_CLKOUTSEL_SHIFT, SIM_SOPT2_CLKOUTSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field FTMFFCLKSEL[25:24] (RW)
 *
 * Selects the fixed frequency clock for FTM0, FTM1, and FTM2.
 *
 * Values:
 * - 0b00 - MCGFFCLK
 * - 0b01 - MCGIRCLK
 * - 0b10 - OSCERCLK
 * - 0b11 - MCGFFCLK
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_FTMFFCLKSEL field. */
#define SIM_RD_SOPT2_FTMFFCLKSEL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_FTMFFCLKSEL_MASK) >> SIM_SOPT2_FTMFFCLKSEL_SHIFT)
#define SIM_BRD_SOPT2_FTMFFCLKSEL(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_FTMFFCLKSEL_SHIFT, SIM_SOPT2_FTMFFCLKSEL_WIDTH))

/*! @brief Set the FTMFFCLKSEL field to a new value. */
#define SIM_WR_SOPT2_FTMFFCLKSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_FTMFFCLKSEL_MASK, SIM_SOPT2_FTMFFCLKSEL(value)))
#define SIM_BWR_SOPT2_FTMFFCLKSEL(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_FTMFFCLKSEL_SHIFT), SIM_SOPT2_FTMFFCLKSEL_SHIFT, SIM_SOPT2_FTMFFCLKSEL_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SOPT4 - System Options Register 4
 ******************************************************************************/

/*!
 * @brief SIM_SOPT4 - System Options Register 4 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT4 register
 */
/*@{*/
#define SIM_RD_SOPT4(base)       (SIM_SOPT4_REG(base))
#define SIM_WR_SOPT4(base, value) (SIM_SOPT4_REG(base) = (value))
#define SIM_RMW_SOPT4(base, mask, value) (SIM_WR_SOPT4(base, (SIM_RD_SOPT4(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT4(base, value) (BME_OR32(&SIM_SOPT4_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT4(base, value) (BME_AND32(&SIM_SOPT4_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT4(base, value) (BME_XOR32(&SIM_SOPT4_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT4 bitfields
 */

/*!
 * @name Register SIM_SOPT4, field FTM0FLT0[0] (RW)
 *
 * Selects the source of FTM0 fault 0.The pin source for fault 0 must be
 * configured for the FTM module fault function through the appropriate pin control
 * register in the port control module.
 *
 * Values:
 * - 0b0 - FTM0_FLT0 pin
 * - 0b1 - CMP0 out
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0FLT0 field. */
#define SIM_RD_SOPT4_FTM0FLT0(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0FLT0_MASK) >> SIM_SOPT4_FTM0FLT0_SHIFT)
#define SIM_BRD_SOPT4_FTM0FLT0(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT0_SHIFT, SIM_SOPT4_FTM0FLT0_WIDTH))

/*! @brief Set the FTM0FLT0 field to a new value. */
#define SIM_WR_SOPT4_FTM0FLT0(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0FLT0_MASK, SIM_SOPT4_FTM0FLT0(value)))
#define SIM_BWR_SOPT4_FTM0FLT0(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0FLT0_SHIFT), SIM_SOPT4_FTM0FLT0_SHIFT, SIM_SOPT4_FTM0FLT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0FLT1[1] (RW)
 *
 * Selects the source of FTM0 fault 1.The pin source for fault 1 must be
 * configured for the FTM module fault function through the appropriate pin control
 * register in the port control module.
 *
 * Values:
 * - 0b0 - FTM0_FLT1 pin
 * - 0b1 - CMP1 out
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0FLT1 field. */
#define SIM_RD_SOPT4_FTM0FLT1(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0FLT1_MASK) >> SIM_SOPT4_FTM0FLT1_SHIFT)
#define SIM_BRD_SOPT4_FTM0FLT1(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT1_SHIFT, SIM_SOPT4_FTM0FLT1_WIDTH))

/*! @brief Set the FTM0FLT1 field to a new value. */
#define SIM_WR_SOPT4_FTM0FLT1(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0FLT1_MASK, SIM_SOPT4_FTM0FLT1(value)))
#define SIM_BWR_SOPT4_FTM0FLT1(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0FLT1_SHIFT), SIM_SOPT4_FTM0FLT1_SHIFT, SIM_SOPT4_FTM0FLT1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1FLT0[2] (RW)
 *
 * Selects the source of FTM1 fault 0.The pin source for fault 0 must be
 * configured for the FTM module fault function through the appropriate pin control
 * register in the port control module.
 *
 * Values:
 * - 0b0 - FTM1_FLT0 pin
 * - 0b1 - CMP0 out
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1FLT0 field. */
#define SIM_RD_SOPT4_FTM1FLT0(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1FLT0_MASK) >> SIM_SOPT4_FTM1FLT0_SHIFT)
#define SIM_BRD_SOPT4_FTM1FLT0(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1FLT0_SHIFT, SIM_SOPT4_FTM1FLT0_WIDTH))

/*! @brief Set the FTM1FLT0 field to a new value. */
#define SIM_WR_SOPT4_FTM1FLT0(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1FLT0_MASK, SIM_SOPT4_FTM1FLT0(value)))
#define SIM_BWR_SOPT4_FTM1FLT0(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM1FLT0_SHIFT), SIM_SOPT4_FTM1FLT0_SHIFT, SIM_SOPT4_FTM1FLT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2FLT0[3] (RW)
 *
 * Selects the source of FTM2 fault 0. The pin source for fault 0 must be
 * configured for the FTM module fault function through the appropriate pin control
 * register in the port control module.
 *
 * Values:
 * - 0b0 - FTM2_FLT0 pin
 * - 0b1 - CMP0 out
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2FLT0 field. */
#define SIM_RD_SOPT4_FTM2FLT0(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2FLT0_MASK) >> SIM_SOPT4_FTM2FLT0_SHIFT)
#define SIM_BRD_SOPT4_FTM2FLT0(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2FLT0_SHIFT, SIM_SOPT4_FTM2FLT0_WIDTH))

/*! @brief Set the FTM2FLT0 field to a new value. */
#define SIM_WR_SOPT4_FTM2FLT0(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2FLT0_MASK, SIM_SOPT4_FTM2FLT0(value)))
#define SIM_BWR_SOPT4_FTM2FLT0(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM2FLT0_SHIFT), SIM_SOPT4_FTM2FLT0_SHIFT, SIM_SOPT4_FTM2FLT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0TRG0SRC[7] (RW)
 *
 * Selects the source of FTM0 hardware trigger 0.
 *
 * Values:
 * - 0b0 - HSCMP0 output drives FTM0 hardware trigger 0
 * - 0b1 - FTM1 channel match drives FTM0 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0TRG0SRC field. */
#define SIM_RD_SOPT4_FTM0TRG0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0TRG0SRC_MASK) >> SIM_SOPT4_FTM0TRG0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM0TRG0SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0TRG0SRC_SHIFT, SIM_SOPT4_FTM0TRG0SRC_WIDTH))

