RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV10Z7/include/MKV10Z7_extension.h
/*! @brief Set the ADC1TRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC1TRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC1TRGSEL_MASK, SIM_SOPT7_ADC1TRGSEL(value)))
#define SIM_BWR_SOPT7_ADC1TRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC1TRGSEL_SHIFT), SIM_SOPT7_ADC1TRGSEL_SHIFT, SIM_SOPT7_ADC1TRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1PRETRGSEL[12] (RW)
 *
 * Selects the ADC1 pre-trigger source when alternative triggers are enabled
 * through ADC1ALTTRGEN.
 *
 * Values:
 * - 0b0 - Pre-trigger A for ADC1. Clearing this field will result in ADHWTSA=1
 *     and ADHWTSB=0.
 * - 0b1 - Pre-trigger B for ADC1. Setting this bit will result in ADHWTSA=0 and
 *     ADHWTSB=1.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC1PRETRGSEL field. */
#define SIM_RD_SOPT7_ADC1PRETRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC1PRETRGSEL_MASK) >> SIM_SOPT7_ADC1PRETRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADC1PRETRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC1PRETRGSEL_SHIFT, SIM_SOPT7_ADC1PRETRGSEL_WIDTH))

/*! @brief Set the ADC1PRETRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC1PRETRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC1PRETRGSEL_MASK, SIM_SOPT7_ADC1PRETRGSEL(value)))
#define SIM_BWR_SOPT7_ADC1PRETRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC1PRETRGSEL_SHIFT), SIM_SOPT7_ADC1PRETRGSEL_SHIFT, SIM_SOPT7_ADC1PRETRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1ALTTRGEN[15] (RW)
 *
 * Enable alternative conversion triggers for ADC1.
 *
 * Values:
 * - 0b0 - PDB trigger selected for ADC1
 * - 0b1 - Alternate trigger selected for ADC1 as defined by ADC1TRGSEL.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC1ALTTRGEN field. */
#define SIM_RD_SOPT7_ADC1ALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC1ALTTRGEN_MASK) >> SIM_SOPT7_ADC1ALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADC1ALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC1ALTTRGEN_SHIFT, SIM_SOPT7_ADC1ALTTRGEN_WIDTH))

/*! @brief Set the ADC1ALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADC1ALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC1ALTTRGEN_MASK, SIM_SOPT7_ADC1ALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADC1ALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC1ALTTRGEN_SHIFT), SIM_SOPT7_ADC1ALTTRGEN_SHIFT, SIM_SOPT7_ADC1ALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC0ALTCLKSRC[25:24] (RW)
 *
 * Selects the source for the ADC0 ALT clock.
 *
 * Values:
 * - 0b00 - OUTDIV5 output
 * - 0b01 - MCGIRCLK
 * - 0b10 - OSCERCLK
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC0ALTCLKSRC field. */
#define SIM_RD_SOPT7_ADC0ALTCLKSRC(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC0ALTCLKSRC_MASK) >> SIM_SOPT7_ADC0ALTCLKSRC_SHIFT)
#define SIM_BRD_SOPT7_ADC0ALTCLKSRC(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC0ALTCLKSRC_SHIFT, SIM_SOPT7_ADC0ALTCLKSRC_WIDTH))

/*! @brief Set the ADC0ALTCLKSRC field to a new value. */
#define SIM_WR_SOPT7_ADC0ALTCLKSRC(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC0ALTCLKSRC_MASK, SIM_SOPT7_ADC0ALTCLKSRC(value)))
#define SIM_BWR_SOPT7_ADC0ALTCLKSRC(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC0ALTCLKSRC_SHIFT), SIM_SOPT7_ADC0ALTCLKSRC_SHIFT, SIM_SOPT7_ADC0ALTCLKSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1ALTCLKSRC[27:26] (RW)
 *
 * Selects the source for the ADC1 ALT clock.
 *
 * Values:
 * - 0b00 - OUTDIV5 output
 * - 0b01 - MCGIRCLK
 * - 0b10 - OSCERCLK
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC1ALTCLKSRC field. */
#define SIM_RD_SOPT7_ADC1ALTCLKSRC(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC1ALTCLKSRC_MASK) >> SIM_SOPT7_ADC1ALTCLKSRC_SHIFT)
#define SIM_BRD_SOPT7_ADC1ALTCLKSRC(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC1ALTCLKSRC_SHIFT, SIM_SOPT7_ADC1ALTCLKSRC_WIDTH))

/*! @brief Set the ADC1ALTCLKSRC field to a new value. */
#define SIM_WR_SOPT7_ADC1ALTCLKSRC(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC1ALTCLKSRC_MASK, SIM_SOPT7_ADC1ALTCLKSRC(value)))
#define SIM_BWR_SOPT7_ADC1ALTCLKSRC(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC1ALTCLKSRC_SHIFT), SIM_SOPT7_ADC1ALTCLKSRC_SHIFT, SIM_SOPT7_ADC1ALTCLKSRC_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SOPT8 - System Options Register 8
 ******************************************************************************/

/*!
 * @brief SIM_SOPT8 - System Options Register 8 (RW)
 *
 * Reset value: 0x00000000U
 *
 * SOPT8[FTMxSYNCBIT] provides a mechanism to allow two or more FTMs to be
 * initialized at the same time. Each of the FTMs needs FTMx_SYNC[TRIG0] to be set
 * before software synchronization can occur. The user can perform a simultaneous
 * write of logic "1" to SOPT8[FTMxSYNCBIT], which sets FTMx_SYNC[TRIG0] input to
 * the corresponding FTM on the same bus clock cycle . The TRIGx inputs react to a
 * rising edge and the user must clear SOPT8[FTMxSYNCBIT] to allow other
 * hardware trigger inputs to force a synchronization/refresh event via FTMx_SYNC[TRIG0]
 * input.
 */
/*!
 * @name Constants and macros for entire SIM_SOPT8 register
 */
/*@{*/
#define SIM_RD_SOPT8(base)       (SIM_SOPT8_REG(base))
#define SIM_WR_SOPT8(base, value) (SIM_SOPT8_REG(base) = (value))
#define SIM_RMW_SOPT8(base, mask, value) (SIM_WR_SOPT8(base, (SIM_RD_SOPT8(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT8(base, value) (BME_OR32(&SIM_SOPT8_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT8(base, value) (BME_AND32(&SIM_SOPT8_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT8(base, value) (BME_XOR32(&SIM_SOPT8_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT8 bitfields
 */

/*!
 * @name Register SIM_SOPT8, field FTM0SYNCBIT[0] (RW)
 *
 * Values:
 * - 0b0 - No effect to FTM0; this allow the hardware trigger options to
 *     function as expected. See SOPT4[FTM0TRG0SRC].
 * - 0b1 - If TRIG0 enabled, this refreshes the FTM0CNTIN and all buffered
 *     registers of the FTM0 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0SYNCBIT field. */
#define SIM_RD_SOPT8_FTM0SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0SYNCBIT_MASK) >> SIM_SOPT8_FTM0SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM0SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0SYNCBIT_SHIFT, SIM_SOPT8_FTM0SYNCBIT_WIDTH))

/*! @brief Set the FTM0SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM0SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0SYNCBIT_MASK, SIM_SOPT8_FTM0SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM0SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0SYNCBIT_SHIFT), SIM_SOPT8_FTM0SYNCBIT_SHIFT, SIM_SOPT8_FTM0SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM1SYNCBIT[1] (RW)
 *
 * Values:
 * - 0b0 - No effect to FTM1; this allows the hardware trigger options to
 *     function as expected. See SOPT4[FTM1TRG0SRC].
 * - 0b1 - If TRIG0 enabled, this refreshes the FTM1CNTIN and all buffered
 *     registers of the FTM1 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM1SYNCBIT field. */
#define SIM_RD_SOPT8_FTM1SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM1SYNCBIT_MASK) >> SIM_SOPT8_FTM1SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM1SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM1SYNCBIT_SHIFT, SIM_SOPT8_FTM1SYNCBIT_WIDTH))

/*! @brief Set the FTM1SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM1SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM1SYNCBIT_MASK, SIM_SOPT8_FTM1SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM1SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM1SYNCBIT_SHIFT), SIM_SOPT8_FTM1SYNCBIT_SHIFT, SIM_SOPT8_FTM1SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2SYNCBIT[2] (RW)
 *
 * Values:
 * - 0b0 - No effect to FTM2; this allows the hardware trigger options to
 *     function as expected. See SOPT4[FTM2TRG0SRC].
 * - 0b1 - If TRIG0 is enabled, this refreshes the FTM2CNTIN and all buffered
 *     registers of the FTM2 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM2SYNCBIT field. */
#define SIM_RD_SOPT8_FTM2SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM2SYNCBIT_MASK) >> SIM_SOPT8_FTM2SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM2SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM2SYNCBIT_SHIFT, SIM_SOPT8_FTM2SYNCBIT_WIDTH))

/*! @brief Set the FTM2SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM2SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM2SYNCBIT_MASK, SIM_SOPT8_FTM2SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM2SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM2SYNCBIT_SHIFT), SIM_SOPT8_FTM2SYNCBIT_SHIFT, SIM_SOPT8_FTM2SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field CARRIER_SELECT[8] (RW)
 *
 * Values:
 * - 0b0 - FTM1_CH1 output provides the carrier signal for Timer Modulation mode
 * - 0b1 - LPTMR0 prescaler output provides the carrier signal for Timer
 *     Modulation mode
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_CARRIER_SELECT field. */
#define SIM_RD_SOPT8_CARRIER_SELECT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_CARRIER_SELECT_MASK) >> SIM_SOPT8_CARRIER_SELECT_SHIFT)
#define SIM_BRD_SOPT8_CARRIER_SELECT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_CARRIER_SELECT_SHIFT, SIM_SOPT8_CARRIER_SELECT_WIDTH))

