RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV10Z7/include/MKV10Z7_extension.h
/*! @brief Set the CARRIER_SELECT field to a new value. */
#define SIM_WR_SOPT8_CARRIER_SELECT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_CARRIER_SELECT_MASK, SIM_SOPT8_CARRIER_SELECT(value)))
#define SIM_BWR_SOPT8_CARRIER_SELECT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_CARRIER_SELECT_SHIFT), SIM_SOPT8_CARRIER_SELECT_SHIFT, SIM_SOPT8_CARRIER_SELECT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH0SRC[16] (RW)
 *
 * Selects the source for FTM0 channel 0 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP
 * - 0b1 - FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH0SRC field. */
#define SIM_RD_SOPT8_FTM0OCH0SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH0SRC_MASK) >> SIM_SOPT8_FTM0OCH0SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH0SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH0SRC_SHIFT, SIM_SOPT8_FTM0OCH0SRC_WIDTH))

/*! @brief Set the FTM0OCH0SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH0SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH0SRC_MASK, SIM_SOPT8_FTM0OCH0SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH0SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH0SRC_SHIFT), SIM_SOPT8_FTM0OCH0SRC_SHIFT, SIM_SOPT8_FTM0OCH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH1SRC[17] (RW)
 *
 * Selects the source for FTM0 channel 1 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP
 * - 0b1 - FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH1SRC field. */
#define SIM_RD_SOPT8_FTM0OCH1SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH1SRC_MASK) >> SIM_SOPT8_FTM0OCH1SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH1SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH1SRC_SHIFT, SIM_SOPT8_FTM0OCH1SRC_WIDTH))

/*! @brief Set the FTM0OCH1SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH1SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH1SRC_MASK, SIM_SOPT8_FTM0OCH1SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH1SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH1SRC_SHIFT), SIM_SOPT8_FTM0OCH1SRC_SHIFT, SIM_SOPT8_FTM0OCH1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH2SRC[18] (RW)
 *
 * Selects the source for FTM0 channel 2 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP
 * - 0b1 - FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH2SRC field. */
#define SIM_RD_SOPT8_FTM0OCH2SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH2SRC_MASK) >> SIM_SOPT8_FTM0OCH2SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH2SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH2SRC_SHIFT, SIM_SOPT8_FTM0OCH2SRC_WIDTH))

/*! @brief Set the FTM0OCH2SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH2SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH2SRC_MASK, SIM_SOPT8_FTM0OCH2SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH2SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH2SRC_SHIFT), SIM_SOPT8_FTM0OCH2SRC_SHIFT, SIM_SOPT8_FTM0OCH2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH3SRC[19] (RW)
 *
 * Selects the source for FTM0 channel 3 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP
 * - 0b1 - FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH3SRC field. */
#define SIM_RD_SOPT8_FTM0OCH3SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH3SRC_MASK) >> SIM_SOPT8_FTM0OCH3SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH3SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH3SRC_SHIFT, SIM_SOPT8_FTM0OCH3SRC_WIDTH))

/*! @brief Set the FTM0OCH3SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH3SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH3SRC_MASK, SIM_SOPT8_FTM0OCH3SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH3SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH3SRC_SHIFT), SIM_SOPT8_FTM0OCH3SRC_SHIFT, SIM_SOPT8_FTM0OCH3SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH4SRC[20] (RW)
 *
 * Selects the source for FTM0 channel 4 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP
 * - 0b1 - FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH4SRC field. */
#define SIM_RD_SOPT8_FTM0OCH4SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH4SRC_MASK) >> SIM_SOPT8_FTM0OCH4SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH4SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH4SRC_SHIFT, SIM_SOPT8_FTM0OCH4SRC_WIDTH))

/*! @brief Set the FTM0OCH4SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH4SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH4SRC_MASK, SIM_SOPT8_FTM0OCH4SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH4SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH4SRC_SHIFT), SIM_SOPT8_FTM0OCH4SRC_SHIFT, SIM_SOPT8_FTM0OCH4SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH5SRC[21] (RW)
 *
 * Selects the source for FTM0 channel 5 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP
 * - 0b1 - FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH5SRC field. */
#define SIM_RD_SOPT8_FTM0OCH5SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH5SRC_MASK) >> SIM_SOPT8_FTM0OCH5SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH5SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH5SRC_SHIFT, SIM_SOPT8_FTM0OCH5SRC_WIDTH))

/*! @brief Set the FTM0OCH5SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH5SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH5SRC_MASK, SIM_SOPT8_FTM0OCH5SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH5SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH5SRC_SHIFT), SIM_SOPT8_FTM0OCH5SRC_SHIFT, SIM_SOPT8_FTM0OCH5SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2OCH0SRC[22] (RW)
 *
 * Selects the source for FTM2 channel 0 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP
 * - 0b1 - FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM2OCH0SRC field. */
#define SIM_RD_SOPT8_FTM2OCH0SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM2OCH0SRC_MASK) >> SIM_SOPT8_FTM2OCH0SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM2OCH0SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM2OCH0SRC_SHIFT, SIM_SOPT8_FTM2OCH0SRC_WIDTH))

