RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV10Z7/include/MKV10Z7_extension.h
/*! @brief Set the FTM2OCH0SRC field to a new value. */
#define SIM_WR_SOPT8_FTM2OCH0SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM2OCH0SRC_MASK, SIM_SOPT8_FTM2OCH0SRC(value)))
#define SIM_BWR_SOPT8_FTM2OCH0SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM2OCH0SRC_SHIFT), SIM_SOPT8_FTM2OCH0SRC_SHIFT, SIM_SOPT8_FTM2OCH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2OCH1SRC[23] (RW)
 *
 * Selects the source for FTM2 channel 1 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP
 * - 0b1 - FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM2OCH1SRC field. */
#define SIM_RD_SOPT8_FTM2OCH1SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM2OCH1SRC_MASK) >> SIM_SOPT8_FTM2OCH1SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM2OCH1SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM2OCH1SRC_SHIFT, SIM_SOPT8_FTM2OCH1SRC_WIDTH))

/*! @brief Set the FTM2OCH1SRC field to a new value. */
#define SIM_WR_SOPT8_FTM2OCH1SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM2OCH1SRC_MASK, SIM_SOPT8_FTM2OCH1SRC(value)))
#define SIM_BWR_SOPT8_FTM2OCH1SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM2OCH1SRC_SHIFT), SIM_SOPT8_FTM2OCH1SRC_SHIFT, SIM_SOPT8_FTM2OCH1SRC_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SDID - System Device Identification Register
 ******************************************************************************/

/*!
 * @brief SIM_SDID - System Device Identification Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SDID register
 */
/*@{*/
#define SIM_RD_SDID(base)        (SIM_SDID_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_SDID bitfields
 */

/*!
 * @name Register SIM_SDID, field PINID[3:0] (RO)
 *
 * Specifies the pincount of the device.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - Reserved
 * - 0b0010 - 32-pin
 * - 0b0011 - 44-pin
 * - 0b0100 - 48-pin
 * - 0b0101 - Reserved
 * - 0b0110 - Reserved
 * - 0b0111 - Reserved
 * - 0b1000 - Reserved
 * - 0b1001 - Reserved
 * - 0b1010 - Reserved
 * - 0b1011 - Reserved
 * - 0b1100 - Reserved
 * - 0b1101 - Reserved
 * - 0b1110 - Reserved
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_PINID field. */
#define SIM_RD_SDID_PINID(base) ((SIM_SDID_REG(base) & SIM_SDID_PINID_MASK) >> SIM_SDID_PINID_SHIFT)
#define SIM_BRD_SDID_PINID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_PINID_SHIFT, SIM_SDID_PINID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field DIEID[11:7] (RO)
 *
 * Specifies the silicon implementation number for the device. This field always
 * reads as 00001.
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_DIEID field. */
#define SIM_RD_SDID_DIEID(base) ((SIM_SDID_REG(base) & SIM_SDID_DIEID_MASK) >> SIM_SDID_DIEID_SHIFT)
#define SIM_BRD_SDID_DIEID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_DIEID_SHIFT, SIM_SDID_DIEID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field REVID[15:12] (RO)
 *
 * Specifies the silicon implementation number for the device.
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_REVID field. */
#define SIM_RD_SDID_REVID(base) ((SIM_SDID_REG(base) & SIM_SDID_REVID_MASK) >> SIM_SDID_REVID_SHIFT)
#define SIM_BRD_SDID_REVID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_REVID_SHIFT, SIM_SDID_REVID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field SRAMSIZE[19:16] (RO)
 *
 * Specifies the size of the System SRAM.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - Reserved
 * - 0b0010 - Reserved
 * - 0b0011 - 4 KB
 * - 0b0100 - 8 KB
 * - 0b0101 - Reserved
 * - 0b0110 - Reserved
 * - 0b0111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SRAMSIZE field. */
#define SIM_RD_SDID_SRAMSIZE(base) ((SIM_SDID_REG(base) & SIM_SDID_SRAMSIZE_MASK) >> SIM_SDID_SRAMSIZE_SHIFT)
#define SIM_BRD_SDID_SRAMSIZE(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_SRAMSIZE_SHIFT, SIM_SDID_SRAMSIZE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field SERIERID[23:20] (RO)
 *
 * Values:
 * - 0b0110 - V-family - Motor control
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SERIERID field. */
#define SIM_RD_SDID_SERIERID(base) ((SIM_SDID_REG(base) & SIM_SDID_SERIERID_MASK) >> SIM_SDID_SERIERID_SHIFT)
#define SIM_BRD_SDID_SERIERID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_SERIERID_SHIFT, SIM_SDID_SERIERID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field SUBFAMID[27:24] (RO)
 *
 * Specifies the V sub-family of the device.
 *
 * Values:
 * - 0b0000 - MKV10xxxx
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SUBFAMID field. */
#define SIM_RD_SDID_SUBFAMID(base) ((SIM_SDID_REG(base) & SIM_SDID_SUBFAMID_MASK) >> SIM_SDID_SUBFAMID_SHIFT)
#define SIM_BRD_SDID_SUBFAMID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_SUBFAMID_SHIFT, SIM_SDID_SUBFAMID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field FAMID[31:28] (RO)
 *
 * Specifies the V-family of the device.
 *
 * Values:
 * - 0b0001 - MKV10Zx
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_FAMID field. */
#define SIM_RD_SDID_FAMID(base) ((SIM_SDID_REG(base) & SIM_SDID_FAMID_MASK) >> SIM_SDID_FAMID_SHIFT)
#define SIM_BRD_SDID_FAMID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_FAMID_SHIFT, SIM_SDID_FAMID_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SCGC4 - System Clock Gating Control Register 4
 ******************************************************************************/

/*!
 * @brief SIM_SCGC4 - System Clock Gating Control Register 4 (RW)
 *
 * Reset value: 0xF0000030U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC4 register
 */
/*@{*/
#define SIM_RD_SCGC4(base)       (SIM_SCGC4_REG(base))
#define SIM_WR_SCGC4(base, value) (SIM_SCGC4_REG(base) = (value))
#define SIM_RMW_SCGC4(base, mask, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC4(base, value) (BME_OR32(&SIM_SCGC4_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC4(base, value) (BME_AND32(&SIM_SCGC4_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC4(base, value) (BME_XOR32(&SIM_SCGC4_REG(base), (uint32_t)(value)))
/*@}*/

/* Unified clock gate bit access macros */
#define SIM_SCGC_BIT_REG(base, index)        (*((volatile uint32_t *)&SIM_SCGC4_REG(base) + (((uint32_t)(index) >> 5) - 3U)))
#define SIM_SCGC_BIT_SHIFT(index)            ((uint32_t)(index) & ((1U << 5) - 1U))
#define SIM_RD_SCGC_BIT(base, index)         (SIM_SCGC_BIT_REG((base), (index)) & (1U << SIM_SCGC_BIT_SHIFT(index)))
#define SIM_BRD_SCGC_BIT(base, index)        (BME_UBFX32(&SIM_SCGC_BIT_REG((base), (index)), SIM_SCGC_BIT_SHIFT(index), 1))
#define SIM_WR_SCGC_BIT(base, index, value)  (SIM_SCGC_BIT_REG((base), (index)) = (SIM_SCGC_BIT_REG((base), (index)) & ~(1U << SIM_SCGC_BIT_SHIFT(index))) | ((uint32_t)(value) << SIM_SCGC_BIT_SHIFT(index)))
#define SIM_BWR_SCGC_BIT(base, index, value) (BME_BFI32(&SIM_SCGC_BIT_REG((base), (index)), ((uint32_t)(value) << SIM_SCGC_BIT_SHIFT(index)), SIM_SCGC_BIT_SHIFT(index), 1))

