RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV10Z7/include/MKV10Z7_extension.h
/*******************************************************************************
 * SIM_UIDML - Unique Identification Register Mid Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDML - Unique Identification Register Mid Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDML register
 */
/*@{*/
#define SIM_RD_UIDML(base)       (SIM_UIDML_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDL - Unique Identification Register Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDL - Unique Identification Register Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDL register
 */
/*@{*/
#define SIM_RD_UIDL(base)        (SIM_UIDL_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_WDOGCTRL - WDOG Control Register
 ******************************************************************************/

/*!
 * @brief SIM_WDOGCTRL - WDOG Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_WDOGCTRL register
 */
/*@{*/
#define SIM_RD_WDOGCTRL(base)    (SIM_WDOGCTRL_REG(base))
#define SIM_WR_WDOGCTRL(base, value) (SIM_WDOGCTRL_REG(base) = (value))
#define SIM_RMW_WDOGCTRL(base, mask, value) (SIM_WR_WDOGCTRL(base, (SIM_RD_WDOGCTRL(base) & ~(mask)) | (value)))
#define SIM_SET_WDOGCTRL(base, value) (BME_OR32(&SIM_WDOGCTRL_REG(base), (uint32_t)(value)))
#define SIM_CLR_WDOGCTRL(base, value) (BME_AND32(&SIM_WDOGCTRL_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_WDOGCTRL(base, value) (BME_XOR32(&SIM_WDOGCTRL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_WDOGCTRL bitfields
 */

/*!
 * @name Register SIM_WDOGCTRL, field WDOGCLKS[1] (RW)
 *
 * Selects the default clock source of the WDOG watchdog. On reset it will be
 * the 1kHZ LPO. The software can change this to the MCGIRCLK, which can be 32KHz
 * or 4Mhz, depending on the MCG configuration.
 *
 * Values:
 * - 0b0 - Internal 1 kHz clock is source to WDOG
 * - 0b1 - MCGIRCLK is source to WDOG
 */
/*@{*/
/*! @brief Read current value of the SIM_WDOGCTRL_WDOGCLKS field. */
#define SIM_RD_WDOGCTRL_WDOGCLKS(base) ((SIM_WDOGCTRL_REG(base) & SIM_WDOGCTRL_WDOGCLKS_MASK) >> SIM_WDOGCTRL_WDOGCLKS_SHIFT)
#define SIM_BRD_WDOGCTRL_WDOGCLKS(base) (BME_UBFX32(&SIM_WDOGCTRL_REG(base), SIM_WDOGCTRL_WDOGCLKS_SHIFT, SIM_WDOGCTRL_WDOGCLKS_WIDTH))

/*! @brief Set the WDOGCLKS field to a new value. */
#define SIM_WR_WDOGCTRL_WDOGCLKS(base, value) (SIM_RMW_WDOGCTRL(base, SIM_WDOGCTRL_WDOGCLKS_MASK, SIM_WDOGCTRL_WDOGCLKS(value)))
#define SIM_BWR_WDOGCTRL_WDOGCLKS(base, value) (BME_BFI32(&SIM_WDOGCTRL_REG(base), ((uint32_t)(value) << SIM_WDOGCTRL_WDOGCLKS_SHIFT), SIM_WDOGCTRL_WDOGCLKS_SHIFT, SIM_WDOGCTRL_WDOGCLKS_WIDTH))
/*@}*/

/*
 * MKV10Z7 SMC
 *
 * System Mode Controller
 *
 * Registers defined in this header file:
 * - SMC_PMPROT - Power Mode Protection register
 * - SMC_PMCTRL - Power Mode Control register
 * - SMC_STOPCTRL - Stop Control Register
 * - SMC_PMSTAT - Power Mode Status register
 */

#define SMC_INSTANCE_COUNT (1U) /*!< Number of instances of the SMC module. */
#define SMC_IDX (0U) /*!< Instance number for SMC. */

/*******************************************************************************
 * SMC_PMPROT - Power Mode Protection register
 ******************************************************************************/

/*!
 * @brief SMC_PMPROT - Power Mode Protection register (RW)
 *
 * Reset value: 0x00U
 *
 * This register provides protection for entry into any low-power run or stop
 * mode. The enabling of the low-power run or stop mode occurs by configuring the
 * Power Mode Control register (PMCTRL). The PMPROT register can be written only
 * once after any system reset. If the MCU is configured for a disallowed or
 * reserved power mode, the MCU remains in its current power mode. For example, if the
 * MCU is in normal RUN mode and AVLP is 0, an attempt to enter VLPR mode using
 * PMCTRL[RUNM] is blocked and PMCTRL[RUNM] remains 00b, indicating the MCU is
 * still in Normal Run mode. This register is reset on Chip Reset not VLLS and by
 * reset types that trigger Chip Reset not VLLS. It is unaffected by reset types
 * that do not trigger Chip Reset not VLLS. See the Reset section details for more
 * information.
 */
/*!
 * @name Constants and macros for entire SMC_PMPROT register
 */
/*@{*/
#define SMC_RD_PMPROT(base)      (SMC_PMPROT_REG(base))
#define SMC_WR_PMPROT(base, value) (SMC_PMPROT_REG(base) = (value))
#define SMC_RMW_PMPROT(base, mask, value) (SMC_WR_PMPROT(base, (SMC_RD_PMPROT(base) & ~(mask)) | (value)))
#define SMC_SET_PMPROT(base, value) (BME_OR8(&SMC_PMPROT_REG(base), (uint8_t)(value)))
#define SMC_CLR_PMPROT(base, value) (BME_AND8(&SMC_PMPROT_REG(base), (uint8_t)(~(value))))
#define SMC_TOG_PMPROT(base, value) (BME_XOR8(&SMC_PMPROT_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SMC_PMPROT bitfields
 */

/*!
 * @name Register SMC_PMPROT, field AVLLS[1] (RW)
 *
 * Provided the appropriate control bits are set up in PMCTRL, this write once
 * bit allows the MCU to enter any very-low-leakage stop mode (VLLSx).
 *
 * Values:
 * - 0b0 - Any VLLSx mode is not allowed
 * - 0b1 - Any VLLSx mode is allowed
 */
/*@{*/
/*! @brief Read current value of the SMC_PMPROT_AVLLS field. */
#define SMC_RD_PMPROT_AVLLS(base) ((SMC_PMPROT_REG(base) & SMC_PMPROT_AVLLS_MASK) >> SMC_PMPROT_AVLLS_SHIFT)
#define SMC_BRD_PMPROT_AVLLS(base) (BME_UBFX8(&SMC_PMPROT_REG(base), SMC_PMPROT_AVLLS_SHIFT, SMC_PMPROT_AVLLS_WIDTH))

/*! @brief Set the AVLLS field to a new value. */
#define SMC_WR_PMPROT_AVLLS(base, value) (SMC_RMW_PMPROT(base, SMC_PMPROT_AVLLS_MASK, SMC_PMPROT_AVLLS(value)))
#define SMC_BWR_PMPROT_AVLLS(base, value) (BME_BFI8(&SMC_PMPROT_REG(base), ((uint8_t)(value) << SMC_PMPROT_AVLLS_SHIFT), SMC_PMPROT_AVLLS_SHIFT, SMC_PMPROT_AVLLS_WIDTH))
/*@}*/

/*!
 * @name Register SMC_PMPROT, field AVLP[5] (RW)
 *
 * Provided the appropriate control bits are set up in PMCTRL, this write-once
 * field allows the MCU to enter any very-low-power mode (VLPR, VLPW, and VLPS).
 *
 * Values:
 * - 0b0 - VLPR, VLPW, and VLPS are not allowed.
 * - 0b1 - VLPR, VLPW, and VLPS are allowed.
 */
/*@{*/
/*! @brief Read current value of the SMC_PMPROT_AVLP field. */
#define SMC_RD_PMPROT_AVLP(base) ((SMC_PMPROT_REG(base) & SMC_PMPROT_AVLP_MASK) >> SMC_PMPROT_AVLP_SHIFT)
#define SMC_BRD_PMPROT_AVLP(base) (BME_UBFX8(&SMC_PMPROT_REG(base), SMC_PMPROT_AVLP_SHIFT, SMC_PMPROT_AVLP_WIDTH))

/*! @brief Set the AVLP field to a new value. */
#define SMC_WR_PMPROT_AVLP(base, value) (SMC_RMW_PMPROT(base, SMC_PMPROT_AVLP_MASK, SMC_PMPROT_AVLP(value)))
#define SMC_BWR_PMPROT_AVLP(base, value) (BME_BFI8(&SMC_PMPROT_REG(base), ((uint8_t)(value) << SMC_PMPROT_AVLP_SHIFT), SMC_PMPROT_AVLP_SHIFT, SMC_PMPROT_AVLP_WIDTH))
/*@}*/

